app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", "show"]]
---
  def show
    if Tour.find_by(id: params[:id])